<?

	$_CFG['_MESS']['deniedu'] = 'Доступ запрещён! Вы уже зарегистрированны!';
	$_CFG['_MESS']['denieda'] = 'Доступ только авторизованным пользователям';
	$_CFG['_MESS']['deniedrobot'] = 'Вы определились как поисковый робот. Доступ только авторизованным пользователям. Если это ощибка, обратитесь к администратору сайта.';
	$_CFG['_MESS']['denied'] = 'Доступ запрещён! У Вас недостаточно прав. Обратитесь к администратору, если вы хотите получить доступ.';
	$_CFG['_MESS']['errdata'] = 'Ошибка. Неверно заданы параметры.';
	$_CFG['_MESS']['nodata'] = 'Данных нет.';
	$_CFG['_MESS']['denied_up'] = 'Доступ запрещён! У Вас недостаточно прав для редактирования данной записи!';
	$_CFG['_MESS']['denied_add'] = 'Доступ запрещён! У Вас недостаточно прав для довления записи.';

	$_CFG['_MESS']['mailok'] = 'Письмо успешно отправленно!';
	$_CFG['_MESS']['mailerr'] = 'Ошибка отправки письма!';
	$_CFG['_MESS']['regok'] = 'Поздравляю! Вы зарегистрированны. Письмо, с подтверждением о регистрации, отправленно на ваш email. В течении 36 часов Вам необходимо подтвердить регистрацию или ваша учётная запись будет удалена.';
	$_CFG['_MESS']['regok2'] = 'Поздравляю! Вы зарегистрированны на нашем сайте. Вам отправлено письмо с логином и паролем для входа в систему.';
	$_CFG['_MESS']['regerr'] = 'Ошибка. Регистрация не успешна.';
	$_CFG['_MESS']['notlogin'] = 'Пользователь с таким логином уже зарегистрирован.';
	$_CFG['_MESS']['notemail'] = 'Пользователь с таким EMAILом уже зарегистрирован.';
	$_CFG['_MESS']['deniedreg'] = 'Регистрация временно запрещена!.';
	$_CFG['_MESS']['authnoconf'] = 'Вы не подтвердили регистрацию.';
	$_CFG['_MESS']['auth_bangroup'] = 'Ваша группа заблокирована. За дополнительной информацией обращайтесь к Администратору сайта.';
	$_CFG['_MESS']['auth_banuser'] = 'Ваш аккаунт заблокирован. За дополнительной информацией обращайтесь к Администратору сайта.';
	$_CFG['_MESS']['auth_notcheck'] = 'Ваш аккаунт не прошел проверку. За дополнительной информацией обращайтесь к Администратору сайта.';
	$_CFG['_MESS']['authok'] = 'Поздравляю! Вы авторизованы.';
	$_CFG['_MESS']['autherr'] = 'Неверный логин либо пароль.Либо пользователь с таким логином не зарегистрирован.';
	$_CFG['_MESS']['exitok'] = 'Выход успешно выполнен!';
	$_CFG['_MESS']['reauth'] = 'На сервер внесли изменения, выполните пожалуста авторизацию по новой';

	$_CFG['_MESS']['confno'] = 'Вы уже подтвердили регистрацию.';
	$_CFG['_MESS']['conferr'] = 'Ошибка подтверждения регистрации.';
	$_CFG['_MESS']['confok'] = 'Поздравляем. Вы успешно подтвердили регистрацию. Теперь вам доступно больше услуг и возможностей для подачи обявления, подробности читайте <a href="/inform.html">здесь</a>.';

	$_CFG['_MESS']['err'] = 'Произошла ошибка. Обратитесь к администрации сайта.';
	$_CFG['_MESS']['update_err'] = 'Произошла ошибка при обновлении данных. Обратитесь к Администрации сайта.';
	$_CFG['_MESS']['update'] = 'Данные успешно изменены';
	$_CFG['_MESS']['update_name'] = 'Редактирование ###1###';
	$_CFG['_MESS']['add'] = 'Данные успешно добавленны';
	$_CFG['_MESS']['add_name'] = 'Добавление ###1###';
	$_CFG['_MESS']['add_err'] = 'Добавление не успешно!!! Обратитесь к Администрации сайта.';
	$_CFG['_MESS']['add_empty'] = 'Нет данных для добаления записи.';
	$_CFG['_MESS']['deleted'] = 'Данные успешно удалены';
	$_CFG['_MESS']['del_err'] = 'Произошла ошибка при удалении данных';

	$_CFG['_MESS']['_file_ok'] = 'Файлы успешно обновлены!';
	$_CFG['_MESS']['_file_err'] = 'Ошибка обновления фаилов.';
	$_CFG['_MESS']['_file_size'] = 'Размер загружаемого файла не более ';

	$_CFG['_MESS']['_captcha'] = 'Введите код с картинки.';

	$_CFG['_MESS']['act1'] = 'Включено';
	$_CFG['_MESS']['act0'] = 'Отключено';
	$_CFG['_MESS']['act5'] = 'Запрос на активацию принят и будет расмотренн администраторм портала.';
	$_CFG['_MESS']['act6'] = 'Данные помечанны как `некоректные`.';

	/*$_CFG['_MESS']['mail_err'] = 'Ошибка отправки письма на ваш e-mail. Вы были зарегистрированы. Для активациии аккуанта обратитесь к Администрации сайта.( E-mail: '.$pglist->config['mail'].' ; ICQ: '.$pglist->config['icq'].')';
	$_CFG['_MESS']['reg_err'] ='Регистрация не успешнa!!! Ошибка БД. Обратитесь к Администрации сайта.( E-mail: '.$pglist->config['mail'].' ; ICQ: '.$pglist->config['icq'].')';
	$_CFG['_MESS']['serv_err'] = '<mess>Ошибка выбора сервисов.</mess><mess>Обратитесь к Администрации сайта.( E-mail: '.$pglist->config['mail'].' ; ICQ: '.$pglist->config['icq'].'</mess>';
	$_CFG['_MESS']['serv_err2'] = 'Ошибка выборки данных! Неверно выбранны параметры либо услуга не доступна!Обратитесь к Администрации сайта.( E-mail: '.$pglist->config['mail'].' ; ICQ: '.$pglist->config['icq'].')';*/

	$_CFG['_MESS']['pay_err'] = 'Оплата прошла не успешно.Услуга не включена.Обратитесь к Администрации сайта.';
	$_CFG['_MESS']['pay_err2'] = 'Оплата прошла не успешно.Услуга не включена и данные не добавлены.Обратитесь к Администрации сайта.';

	$_CFG['_MESS']['year_name'] = 'ГОД';
	$_CFG['_MESS']['month_name'] = 'Месяц';
	$_CFG['_MESS']['day_name'] = 'День';
	$_CFG['_MESS']['hour_name'] = 'Час';
	$_CFG['_MESS']['min_name'] = '';
	$_CFG['_MESS']['month'] = array(
		"01" => "январь",
		"02" => "февраль",
		"03" => "март",
		"04" => "апрель",
		"05" => "май",
		"06" => "июнь",
		"07" => "июль",
		"08" => "август",
		"09" => "сентябрь",
		"10" => "октябрь",
		"11" => "ноябрь",
		"12" => "декабрь");

	$_CFG['_MESS']['month2'] = array(
		"01" => "января",
		"02" => "февраля",
		"03" => "марта",
		"04" => "апреля",
		"05" => "мая",
		"06" => "июня",
		"07" => "июля",
		"08" => "августа",
		"09" => "сентября",
		"10" => "октября",
		"11" => "ноября",
		"12" => "декабря");

	$_CFG['_MESS']['week'] = array(
		"0"=>"Пн",
		"1"=>"Вт",
		"2"=>"Ср",
		"3"=>"Чт",
		"4"=>"Пт",
		"5"=>"Сб",
		"6"=>"Вс"
		);

	$_CFG['_MESS']['_install_err'] = 'Ошибка создания таблицы';
	$_CFG['_MESS']['_big_err'] = 'Критическая ошибка! Проблемы с подключением к БД.';


	$_CFG['_MESS']['_reinstall'] = 'Переустановка модуля';
	$_CFG['_MESS']['_reinstall_ok'] = 'Модуль успешно переустановлен!';
	$_CFG['_MESS']['_reinstall_info'] = 'Переустановка модуля удаляет все данные из таблицы, и приводит таблицу к исходному виду!';

	$_CFG['_MESS']['_config'] = 'Настроика модуля';
	$_CFG['_MESS']['_configno'] = 'Настроика модуля не доступна!';

	$_CFG['_MESS']['_reindex'] = 'Переиндексация';
	$_CFG['_MESS']['_reindex_ok'] = 'Модуль успешно переиндексирован!';
	$_CFG['_MESS']['_reindex_err'] = 'Ошибка индексирования!';
	$_CFG['_MESS']['_reindex_info'] = 'Внесение данных в базу поиска! Применяется при изменении базы данных модуля.';

	$_CFG['_MESS']['_recheck'] = 'Обновление полей БД и Обновление связи БД с фаилами на сервере!';
	$_CFG['_MESS']['_recheck_ok'] = 'Поля таблицы обновлены!';
	$_CFG['_MESS']['_recheck_err'] = 'Ошибка обновления полей.';
	$_CFG['_MESS']['_checkdir_error'] = 'Ошибка создания папки `###1###`';
	$_CFG['_MESS']['_recheck_select_nothing'] = 'Не выбран ни один запрос';
	$_CFG['_MESS']['_recheck_have_nothing'] = 'Обновление не требуется';
	$_CFG['_MESS']['_recheck_make_list_err'] = 'Ошибка создания списка запросов';

	$_CFG['_MESS']['_submit'] = 'Выполнить';
	$_CFG['_MESS']['_save'] = 'Сохранить';
	$_CFG['_MESS']['_saveclose'] = 'Сохранить и закрыть';
	$_CFG['_MESS']['_close'] = 'Закрыть';
	$_CFG['_MESS']['_mailsend'] = 'Отправить письмо';

	$_CFG['_MESS']['_comment_phone2'] = 'Для нескольких телефонов - через запятую.[цифры,скобки,пробел,тире,запятые]';
	$_CFG['_MESS']['_comment_phone'] = 'Только один телефоннный номер.[цифры,скобки,пробел,тире]';
	
	$_CFG['_MESS']['_listroot'] = ' --- ';

	$_CFG['_MESS']['_err_1'] = 'Поле необходимо заполнить';
	$_CFG['_MESS']['_err_2'] = 'Поле `###1###` не может быть более ###2### символов. Превышение на ###3### символов';
	$_CFG['_MESS']['_err_21'] = 'Поле `###1###` не может быть менее ###2### символов. Меньше на ###3### символов';
	$_CFG['_MESS']['_err_22'] = 'Поле `###1###` не может быть больше ';
	$_CFG['_MESS']['_err_23'] = 'Поле `###1###` не может быть меньше ';
	$_CFG['_MESS']['_err_29'] = 'Размер загружаемого файла `###1###` не может быть больше';
	$_CFG['_MESS']['_err_3'] = 'Поле заполненно некорректно.';
	$_CFG['_MESS']['_err_31'] = 'Вы неверно ввели код.';
	$_CFG['_MESS']['_err_32'] = 'В поле `###1###` вы не подтвердили пароль.';
	$_CFG['_MESS']['_err_33'] = 'В поле `###1###` ошибка выбора данных.';
	$_CFG['_MESS']['_err_39'] = 'Неверный тип файла `###1###`. Разрешенно загружать файлы следущих типов ';
	$_CFG['_MESS']['_err_40'] = 'Ошибка загрузки файла `###1###` на сервер.';
	$_CFG['_MESS']['_err_4'] = 'В поле `###1###` ссылка не действительна.';

	$_CFG['_ACT_TITLE'][7] = 'Истек срок размещения';
	$_CFG['_ACT_TITLE'][6] = 'Откл';
	$_CFG['_ACT_TITLE'][5] = 'Активировать пользователем';
	$_CFG['_ACT_TITLE'][4] = 'Удалено пользователем';
	$_CFG['_ACT_TITLE'][3] = 'Редакт. пользователем';
	$_CFG['_ACT_TITLE'][2] = 'Дезактивировано пользователем';
	$_CFG['_ACT_TITLE'][1] = 'Вкл';
	$_CFG['_ACT_TITLE'][0] = 'Новоё';
	$_CFG['_EDIT_TITLE'] = 'редактировать';
	$_CFG['_DEL_TITLE'] = 'удалить';

  /******************/
 /*$_CFG['enum']***/
/******************/


	$_CFG['enum']['_MOP'] = array(
		5=>5, 
		10=>10, 
		20=>20,
		30=>30,
		50=>50,
		100=>100,
		150=>150,
		200=>200);

	$_CFG['enum']['menu'] = array(
		0=>'',
		1=>'Меню №1',
		2=>'Меню №2',
		3=>'Меню №3');

	$_CFG['enum']['marker'] = array(
		'text'=>'text',
		'head'=>'head',
		'blockadd'=>'blockadd',
		'param'=>'param',
		'path'=>'path',
		'logs'=>'logs',
		'foot'=>'foot');

	$_CFG['enum']['active'] = array(
		0=>'Неактивное, новое', 
		1=>'Активное', 
		2=>'Неактивное, выключено пользователем', 
		3=>'Неактивное, отредактировано пользователем', 
		4=>'Удалено пользователем', 
		5=>'Неактивное, включено пользователем', 
		6=>'Неактивное, некорректное');

	$_CFG['enum']['yesno'] = array(
		0=>'НЕТ', 
		1=>'ДА');

	$_CFG['enum']['yesno2'] = array(
		0=>'НЕТ', 
		1=>'ЕСТЬ');
?>
