<?
	//create time 2011-08-06 00:09
	$_CFG['wep']['locale'] = 'default';
	$_CFG['wep']['bug_hunter'] = array ( 0 => '0', 1 => '1', 16 => '16', 64 => '64', 4 => '4', 32 => '32', 128 => '128', 2 => '2', 4096 => '4096', 256 => '256', 512 => '512', 2048 => '2048',);
	$_CFG['site']['work_title'] = 'Профилактические работы на сайте';
	$_CFG['site']['work_text'] = '<h2 style="color:red;">Технический перерыв</h2> Работа сайта восстановиться в 14.05.2010 18-00 по москве ';
	$_CFG['site']['redirectForRobots'] = 0;
